In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('supershops.csv')

In [3]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [4]:
df.shape

(50, 5)

In [5]:
df1 = df.copy()
df2 = df.copy()
df3 = df.copy()
df4 = df.copy()

# Normalization

In [6]:
# http://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.MinMaxScaler.html
from sklearn.preprocessing import MinMaxScaler

In [7]:
m = MinMaxScaler(feature_range=(0,1))

In [8]:
ms = m.fit(df[['Marketing Spend']])
ms

MinMaxScaler()

In [9]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [10]:
df['Marketing Spend'] = ms.transform(df[['Marketing Spend']])

In [11]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [12]:
df['Administration'] = m.fit_transform(df[['Administration']])

In [13]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744  471784.10    Dhaka  192261.83
1         0.983359        0.761972  443898.53      Ctg  191792.06
2         0.927985        0.379579  407934.54  Rangpur  191050.39
3         0.873136        0.512998  383199.62    Dhaka  182901.99
4         0.859438        0.305328  366168.42  Rangpur  166187.94

In [14]:
df['Transport'] = m.fit_transform(df[['Transport']])

In [15]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   1.000000    Dhaka  192261.83
1         0.983359        0.761972   0.940893      Ctg  191792.06
2         0.927985        0.379579   0.864664  Rangpur  191050.39
3         0.873136        0.512998   0.812235    Dhaka  182901.99
4         0.859438        0.305328   0.776136  Rangpur  166187.94

# Standardization

In [23]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [20]:
from sklearn.preprocessing import StandardScaler

In [24]:
scaler = StandardScaler()

In [26]:
scaler

StandardScaler()

In [29]:
df2['Marketing Spend'] = scaler.fit_transform(df2[['Marketing Spend']])

In [30]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913       136897.80  471784.10    Dhaka  192261.83
1         1.955860       151377.59  443898.53      Ctg  191792.06
2         1.754364       101145.55  407934.54  Rangpur  191050.39
3         1.554784       118671.85  383199.62    Dhaka  182901.99
4         1.504937        91391.77  366168.42  Rangpur  166187.94

In [31]:
df2['Administration'] = scaler.fit_transform(df2[['Administration']])

In [33]:
df2['Transport'] = scaler.fit_transform(df2[['Transport']])

In [36]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753   2.165287    Dhaka  192261.83
1         1.955860        1.082807   1.929843      Ctg  191792.06
2         1.754364       -0.728257   1.626191  Rangpur  191050.39
3         1.554784       -0.096365   1.417348    Dhaka  182901.99
4         1.504937       -1.079919   1.273550  Rangpur  166187.94

# Robust Scaler

In [37]:
from sklearn.preprocessing import RobustScaler
rosc = RobustScaler()

In [43]:
ms3 = rosc.fit(df3[['Marketing Spend']])

In [39]:
df3 ['Marketing Spend'] = ms3.transform(df3[['Marketing Spend']])

In [40]:
df3 ['Administration'] = ms3.transform(df3[['Administration']])

In [41]:
df3 ['Transport'] = ms3.transform(df3[['Transport']])

In [44]:
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        1.035356   6.465966    Dhaka  192261.83
1         1.452113        1.270164   6.013766      Ctg  191792.06
2         1.303634        0.455588   5.430563  Rangpur  191050.39
3         1.156567        0.739799   5.029455    Dhaka  182901.99
4         1.119836        0.297418   4.753272  Rangpur  166187.94

# Max Absolute Scaler

In [45]:
from sklearn.preprocessing import MaxAbsScaler

In [46]:
scaler = MaxAbsScaler()

In [47]:
ms = scaler.fit(df4[['Marketing Spend']])

In [48]:
df4['Marketing Spend'] = ms.transform(df4[['Marketing Spend']])

In [50]:
df4['Administration'] = ms.transform(df4[['Administration']])

In [51]:
df4['Transport'] = ms.transform(df4[['Transport']])

In [52]:
df4.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.827931   2.853259    Dhaka  192261.83
1         0.983359        0.915502   2.684613      Ctg  191792.06
2         0.927985        0.611709   2.467109  Rangpur  191050.39
3         0.873136        0.717704   2.317517    Dhaka  182901.99
4         0.859438        0.552720   2.214516  Rangpur  166187.94